{
    "version": "https://jsonfeed.org/version/1",
    "title": "pianetararo",
    "description": "",
    "home_page_url": "https://pianetararo.org",
    "feed_url": "https://pianetararo.org/feed.json",
    "user_comment": "",
    "icon": "https://pianetararo.org/media/website/PIANETARARO-1-1-1.svg",
    "author": {
        "name": "Pianetararo Associazione Culturale"
    },
    "items": [
        {
            "id": "https://pianetararo.org/privacy-e-intelligenza-artificiale-cosa-dobbiamo-sapere-nel-2025/",
            "url": "https://pianetararo.org/privacy-e-intelligenza-artificiale-cosa-dobbiamo-sapere-nel-2025/",
            "title": "Privacy e intelligenza artificiale: cosa dobbiamo sapere nel 2025",
            "summary": "Diciamocelo: ormai interagire con un chatbot – che sia ChatGPT, Gemini, Claude o uno dei mille assistenti virtuali – è diventato quasi come fare una chiacchierata al bar. Solo che, al posto del barista, c’è un algoritmo che ci risponde in un italiano perfetto (o&hellip;",
            "content_html": "<p> </p>\n<p><span style=\"font-weight: 400;\">Diciamocelo: ormai interagire con un chatbot – che sia ChatGPT, Gemini, Claude o uno dei mille assistenti virtuali – è diventato quasi come fare una chiacchierata al bar. Solo che, al posto del barista, c’è un algoritmo che ci risponde in un italiano perfetto (o quasi). Studenti, insegnanti, genitori, professionisti – chi più chi meno – ci siamo messi a “parlare” con queste AI per fare domande, chiedere aiuto, o semplicemente toglierci una curiosità. Ma sai cosa? Ogni volta che parliamo con un LLM – un modello linguistico generativo, per usare il termine tecnico – stiamo lasciando dietro di noi una scia di dati. Un po’ come se, dopo aver chiesto al barista un consiglio, scoprissimo che stava registrando la nostra conversazione per studiarci meglio.</span></p>\n<p><span style=\"font-weight: 400;\">E qui si apre un tema enorme: </span><strong>la privacy</strong><span style=\"font-weight: 400;\">. Perché questi strumenti, sì, sono incredibili – ma a che prezzo? Quali dati cediamo, consapevoli o meno, quando chiediamo un consiglio per l’ansia, carichiamo la foto di famiglia su un generatore d’immagini, o raccontiamo una situazione privata al chatbot? Questo articolo (che sì, è lungo, ma merita) prova a fare chiarezza e stimolare qualche riflessione. Analizzeremo i rischi, le leggi in gioco – il </span><a href=\"https://eur-lex.europa.eu/legal-content/IT/TXT/?uri=CELEX:32016R0679\"><span style=\"font-weight: 400;\">GDPR</span></a><span style=\"font-weight: 400;\">, l’</span><a href=\"https://artificialintelligenceact.eu/\"><span style=\"font-weight: 400;\">AI Act</span></a><span style=\"font-weight: 400;\">  – e ci faremo anche qualche domanda scomoda: </span><strong>cosa fanno le Big Tech con i nostri dati?</strong><span style=\"font-weight: 400;\"> E noi, ci dobbiamo preoccupare?</span></p>\n<p><span style=\"font-weight: 400;\">Prima però, fermiamoci un attimo a guardare i rischi veri. Quelli meno ovvi. Quelli che spesso ignoriamo mentre chattiamo con l’IA pensando “tanto è solo un robot”.</span></p>\n<p><span style=\"font-weight: 400;\">Non è roba da smanettoni o da esperti: riguarda tutti noi. Studenti, insegnanti, genitori, professionisti, chiunque usi questi strumenti per lavorare, imparare o semplicemente divertirsi. Perché l’IA non è più “roba da laboratorio”: è parte della nostra vita di tutti i giorni. E capire come funziona – e come può influire sulla nostra privacy – è un modo per proteggere non solo i nostri dati, ma anche la nostra libertà di essere chi siamo, senza che un algoritmo ci metta in un’etichetta.</span></p>\n<h2>I rischi principali: una panoramica pratica</h2>\n<p><span style=\"font-weight: 400;\">Partiamo dalle basi. Usare uno strumento di Intelligenza artificiale, per esempio un Large Language Model come ChatGPT, non è come scrivere sul quaderno: è come parlare in un microfono acceso, con qualcuno (o qualcosa) che sta ascoltando, registrando e, talvolta, imparando da quello che diciamo. Ecco una carrellata di rischi, spiegati in modo semplice – con esempi reali, perché non stiamo parlando di teorie campate in aria.</span></p>\n<h5>⚠️ Condivisione involontaria di dati</h5>\n<p><span style=\"font-weight: 400;\">Quando scrivi “Ehi ChatGPT, dammi un consiglio per il compleanno del mio amico Marco, che soffre di ansia”? Ecco: in quel momento hai appena dato due informazioni personali – il nome di Marco e un dato sensibile sulla sua salute. Magari non ci hai fatto caso, ma il chatbot (e chi lo gestisce) le ha registrate. E potrebbero rimanere lì, nei log, anche per mesi.</span></p>\n<h5>⚠️Prompt conservati e riutilizzati</h5>\n<p><span style=\"font-weight: 400;\">Le conversazioni con gli LLM non spariscono nel nulla. Spesso vengono archiviate e usate per “insegnare” al modello a migliorare. Quindi il tuo messaggio, la tua storia, le tue domande – potrebbero contribuire ad addestrare la prossima versione di quel chatbot. Se pensi che basti cancellare la cronologia per stare tranquilli, sappi che anche in quel caso i dati potrebbero rimanere salvati per 30 giorni (come succedeva e succede anche con alcuni piani con ChatGPT) oppure anche </span><a href=\"https://www.repubblica.it/tecnologia/2025/06/09/news/open-ai-obbligata-conservare-conversazioni-chatgpt-new-york-times-424657181/\"><span style=\"font-weight: 400;\">per sempre</span></a><span style=\"font-weight: 400;\">.</span></p>\n<h5>⚠️Occhi umani dietro le quinte</h5>\n<p><span style=\"font-weight: 400;\">Non c’è solo l’algoritmo: a volte, per migliorare l’IA, ci sono anche persone in carne e ossa che leggono pezzi delle conversazioni. Certo, si parla di chat “anonimizzate”, ma se scrivi “Mio figlio Lorenzo fa le medie a Roma e ha problemi con la matematica”, quei dati, anche senza il tuo nome, sono comunque riconoscibili. E magari finiscono davanti agli occhi di un revisore umano, chissà dove nel mondo.</span></p>\n<h5>⚠️Tracciamento invisibile e fingerprinting</h5>\n<p><span style=\"font-weight: 400;\">Un po’ come quando navighi su un sito e ti senti “seguito” dagli annunci, anche qui i sistemi AI raccolgono informazioni di contorno: il tuo IP, il browser, il dispositivo, perfino quanto tempo rimani su una pagina o a che ora scrivi. Tutti dettagli che, messi insieme, costruiscono un profilo abbastanza dettagliato – e tu magari nemmeno te ne accorgi. È come lasciare briciole digitali che qualcun altro raccoglie.</span></p>\n<h5>⚠️ Profilazione implicita</h5>\n<p><span style=\"font-weight: 400;\">Anche senza dirlo esplicitamente, il chatbot può “capire” cose su di te. Se gli chiedi spesso consigli su sintomi di malattie, oppure parli di viaggi in determinati Paesi, o di hobby particolari, il sistema può dedurre – e magari registrare – che sei interessato a quelle cose. E questo profilo, se finisce in mani sbagliate o viene usato per scopi di marketing, o peggio azioni di condizionamento e diventa un problema serio.</span></p>\n<h5>⚠️ Perdita di controllo sui dati</h5>\n<p><span style=\"font-weight: 400;\">Una volta che i tuoi dati entrano in un sistema AI, non c’è più modo di riprenderli indietro. Sono archiviati su server, magari in un altro continente, e chi garantisce che non vengano usati in futuro per scopi diversi? Pensiamo, ad esempio, a una mamma che carica foto di famiglia su un generatore di immagini AI: quelle immagini potrebbero essere usate per altro, e se domani c’è una violazione o un cambio di policy, potrebbero anche finire in mani sbagliate. </span></p>\n<h5>⚠️ Memorizzazione nascosta e rischio leak</h5>\n<p><span style=\"font-weight: 400;\">Ecco il punto forse più inquietante: i modelli AI apprendono dai dati, e talvolta possono “ricordare” dettagli sensibili, anche se non dovrebbero. Ci sono stati casi in cui i ricercatori hanno dimostrato che un chatbot poteva rigenerare numeri di carte di credito usate durante l’addestramento. E se capita con una carta, perché non con il tuo indirizzo email o il nome del tuo amico Marco?</span></p>\n<h5>⚠️ Allucinazioni problematiche o pericolose</h5>\n<p><span style=\"font-weight: 400;\">Le IA non sono infallibili. Possono “inventare” dati – e a volte, quei dati inventati riguardano persone vere. Se il chatbot ti dà la data di nascita sbagliata di un politico, o ti attribuisce un titolo di studio che non hai mai conseguito, si tratta di un problema serio di accuratezza. E correggere questi errori? Spesso impossibile, perché l’IA non sa nemmeno da dove ha preso quell’informazione.</span></p>\n<h5>⚠️ Minori e poca protezione</h5>\n<p><span style=\"font-weight: 400;\">Non dimentichiamo i più giovani: i minorenni usano chatbot senza sempre capire i rischi. Fino al 2023, bastava inserire una data di nascita falsa per usare ChatGPT, anche se avevi 12 anni. Solo dopo interventi dei Garanti (come quello italiano) si è iniziato a introdurre controlli più robusti, ma il problema rimane: i dati dei minori finiscono spesso nel sistema, senza garanzie e consapevolezza.</span></p>\n<h5>⚠️ Data breach e falle di sicurezza</h5>\n<p><span style=\"font-weight: 400;\">Infine, i bug e le violazioni. È già successo (ad esempio a marzo 2024, con ChatGPT) che per errore tecnico alcuni utenti vedessero le chat di altri – inclusi dettagli su abbonamenti e pagamenti. OpenAI all’epoca non avvisò subito tutti i Garanti europei, e questo ha portato a una multa salata. È un promemoria importante: i dati che forniamo a queste piattaforme non sono blindati, e un semplice bug può renderli visibili ad altri.</span></p>\n<hr>\n<h2>Le regole del gioco: GDPR, AI Act e il nodo della privacy nell’IA</h2>\n<p><span style=\"font-weight: 400;\">Cosa rende il mondo dell’intelligenza artificiale così affascinante, ma anche così complicato? Il fatto che corriamo alla velocità della luce – nuovi modelli, nuove app, nuove possibilità – mentre le leggi, beh, fanno un po’ fatica a stare al passo. E non è per cattiveria: regolamentare l’IA è come provare a dare la caccia a un’ombra che cambia forma ogni volta che ti avvicini. Ma vediamo insieme cosa sta succedendo, perché se usi un chatbot, agenti o lavori con questi strumenti, capire le regole è fondamentale.</span></p>\n<h3>Il GDPR: una bussola ancora valida, ma con qualche ammaccatura</h3>\n<p><span style=\"font-weight: 400;\">Partiamo da quello che già conosciamo: il </span><a href=\"https://eur-lex.europa.eu/legal-content/IT/TXT/?uri=CELEX:32016R0679\"><strong>Regolamento Generale sulla Protezione dei Dati (GDPR)</strong></a><span style=\"font-weight: 400;\">. Sì, proprio quello che ci ricorda di leggere le informative privacy (quelle chilometriche che spesso scorriamo velocemente). Il GDPR non è roba vecchia: anche nel 2025 resta </span><strong>la cornice principale</strong><span style=\"font-weight: 400;\"> per la protezione dei dati personali in Europa, e si applica pure ai dati trattati dagli LLM.</span></p>\n<p><span style=\"font-weight: 400;\">Perché è importante? Perché il GDPR stabilisce principi fondamentali come:</span></p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><strong>Trasparenza</strong><span style=\"font-weight: 400;\">: devi sapere come vengono usati i tuoi dati.</span><span style=\"font-weight: 400;\"><br><br></span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><strong>Minimizzazione</strong><span style=\"font-weight: 400;\">: non si possono raccogliere più dati del necessario.</span><span style=\"font-weight: 400;\"><br><br></span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><strong>Esattezza</strong><span style=\"font-weight: 400;\">: i dati personali devono essere corretti e aggiornati.</span><span style=\"font-weight: 400;\"><br><br></span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><strong>Sicurezza</strong><span style=\"font-weight: 400;\">: le aziende devono proteggere i tuoi dati da violazioni o furti.</span><span style=\"font-weight: 400;\"><br><br></span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">E, soprattutto, </span><strong>diritti dell’interessato</strong><span style=\"font-weight: 400;\">: puoi chiedere di accedere ai tuoi dati, farli cancellare, correggere o opporsi al trattamento.</span><span style=\"font-weight: 400;\"><br><br></span></li>\n</ul>\n<p><span style=\"font-weight: 400;\">Ora, fin qui tutto chiaro, no? Ma il punto è che </span><strong>gli LLM non sono come una rubrica telefonica</strong><span style=\"font-weight: 400;\">. Sono sistemi complessi, che apprendono da quantità immense di dati – inclusi i tuoi post sui social, i tuoi articoli, perfino quel commento lasciato dieci anni fa su un forum dimenticato. E qui casca l’asino: </span><strong>su quale base legale si fonda il loro addestramento?</strong></p>\n<h3>La questione della base giuridica: legittimo interesse o consenso?</h3>\n<p><span style=\"font-weight: 400;\">Prendiamo </span><a href=\"https://www.agendadigitale.eu/sicurezza/privacy/ai-di-meta-e-davvero-legittimo-interesse-lecito-dubitarne/\"><span style=\"font-weight: 400;\">Meta</span></a><span style=\"font-weight: 400;\"> o OpenAI e ChatGPT come esempio. Quando hanno iniziato a raccogliere dati da internet (forum, blog, pagine web) per addestrare i modelli, non hanno chiesto a nessuno. Nessuna email, nessun banner di consenso. Loro hanno detto: “Va bene così, è nel nostro legittimo interesse”.</span></p>\n<p><span style=\"font-weight: 400;\">Il problema? Beh, il GDPR non è così permissivo. Usare dati personali – anche se pubblici – per scopi di addestramento richiede una </span><strong>valutazione rigorosa</strong><span style=\"font-weight: 400;\">, e forse anche il consenso esplicito degli interessati. Il Garante Privacy italiano, infatti, ha sollevato la questione: </span><strong>“Scusate, ma su che base giuridica avete preso e usato questi dati?”</strong></p>\n<p><span style=\"font-weight: 400;\">Risultato: il caso è finito per esempio nelle mani dell’Autorità irlandese (che, per via del meccanismo del “one-stop-shop” in UE, funge da capofila per OpenAI). E qui siamo ancora in attesa di una decisione chiara, ma il messaggio è forte: </span><strong>le regole valgono per tutti, anche per le Big Tech</strong><span style=\"font-weight: 400;\">. Non basta dire “è nel nostro interesse”. Serve dimostrarlo.</span></p>\n<h3>Trasparenza: il nodo delle informative (e la fatica di capirle)</h3>\n<p><span style=\"font-weight: 400;\">Il GDPR impone anche che le aziende spieghino bene come usano i dati. Ma spiegare bene, cosa significa? Facciamo un esempio: per un po’, OpenAI non diceva chiaramente che i prompt degli utenti (cioè le domande fatte a ChatGPT) venivano usati per addestrare il modello. Né specificava che i dati personali inseriti nelle chat potevano finire in mano a revisori umani.</span></p>\n<p><span style=\"font-weight: 400;\">Solo dopo l’intervento del </span><a href=\"https://www.garanteprivacy.it/home/docweb/-/docweb-display/docweb/10085432\"><span style=\"font-weight: 400;\">Garante italiano – con tanto di sanzione da 15 milioni di euro a dicembre 2024 – OpenAI</span></a><span style=\"font-weight: 400;\"> ha dovuto aggiornare la privacy policy, avviare una campagna informativa, e mettere a disposizione opzioni per “uscire” dal training (l’opt-out). Ma resta un problema: </span><strong>anche se disattivi la cronologia, i tuoi dati restano per 30 giorni sui server.</strong><span style=\"font-weight: 400;\"> E, spesso, non è così semplice capire dove finiscano davvero le informazioni.</span></p>\n<p><span style=\"font-weight: 400;\">È un po’ come leggere le clausole scritte in piccolo in un contratto di assicurazione: puoi farlo, ma devi armarti di pazienza – e magari di una lente d’ingrandimento.</span></p>\n<h3>Esattezza e allucinazioni: quando l’IA sbaglia (e non puoi rimediare)</h3>\n<p><span style=\"font-weight: 400;\">Un altro tema caldo è quello dell’</span><strong>accuratezza</strong><span style=\"font-weight: 400;\">. Secondo il GDPR, i dati personali devono essere </span><strong>corretti e aggiornati</strong><span style=\"font-weight: 400;\">. Ma con un LLM, come fai? Se il modello ha imparato che “Mario Rossi è nato nel 1978” e in realtà Mario Rossi è nato nel 1982, come correggi quell’informazione? La risposta breve è: </span><strong>non puoi, almeno non facilmente</strong><span style=\"font-weight: 400;\">.</span></p>\n<h3>Minori e soggetti vulnerabili: tutele deboli, rischi alti</h3>\n<p><span style=\"font-weight: 400;\">Un altro punto dolente riguarda i </span><strong>minori</strong><span style=\"font-weight: 400;\">. Il GDPR dice chiaramente che per usare un servizio online sotto i 16 anni (o 13, in base allo Stato), serve il consenso dei genitori. Eppure, fino a poco tempo fa, chiunque poteva accedere a ChatGPT semplicemente inserendo una data di nascita a caso. Solo dopo il richiamo del Garante, OpenAI ha introdotto controlli più robusti (prima un semplice “age-gate”, poi un sistema più avanzato con verifica di terze parti). Ma siamo ancora in una fase di rodaggio: il sistema funziona davvero? E come si tutelano i dati dei minori una volta dentro il sistema?</span></p>\n<p><span style=\"font-weight: 400;\">Insomma, le falle ci sono. E l’impressione è che le aziende abbiano corso per lanciare i prodotti, senza preoccuparsi troppo delle regole – salvo poi correre ai ripari quando arrivano le multe.</span></p>\n<h3>Il nuovo arrivato: l’AI Act europeo</h3>\n<p><span style=\"font-weight: 400;\">E ora parliamo di lui, l’</span><a href=\"https://artificialintelligenceact.eu/\"><strong>AI Act</strong></a><span style=\"font-weight: 400;\">, che nel 2025 è in dirittura d’arrivo come primo regolamento europeo “omnibus” sull’IA. Il GDPR resta la legge sui dati personali, ma l’AI Act interviene </span><strong>a monte</strong><span style=\"font-weight: 400;\">, fissando regole per lo sviluppo e l’uso delle IA – compresi i modelli generativi come ChatGPT.</span></p>\n<p><span style=\"font-weight: 400;\">Quali sono i punti chiave? Te li riassumo così:</span></p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><strong>Classificazione per rischio</strong><span style=\"font-weight: 400;\">: l’IA viene divisa in categorie (inaccettabile, alto rischio, basso, minimo). Gli LLM general-purpose non sono “ad alto rischio” di per sé, ma attenzione: se usati in certi contesti (per esempio per la selezione del personale), scattano regole più stringenti.</span><span style=\"font-weight: 400;\"><br><br></span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><strong>Trasparenza sui dati di training</strong><span style=\"font-weight: 400;\">: i fornitori dovranno pubblicare un “riassunto” dei dati usati per addestrare il modello. Non tutti i dettagli, ma almeno un’indicazione. Questo per dare un minimo di controllo: sapere se ci sono dentro i tuoi post o quelli di qualcun altro.</span><span style=\"font-weight: 400;\"><br><br></span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><strong>Obblighi di sicurezza</strong><span style=\"font-weight: 400;\">: ridurre il rischio di output illegali o discriminatori.</span><span style=\"font-weight: 400;\"><br><br></span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><strong>Etichettatura dei contenuti generati</strong><span style=\"font-weight: 400;\">: testi, immagini, video prodotti dall’IA dovranno essere segnalati come tali, per evitare inganni e deepfake.</span><span style=\"font-weight: 400;\"><br><br></span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><strong>Divieti specifici</strong><span style=\"font-weight: 400;\">: per esempio, niente più scraping massivo di immagini per creare database di riconoscimento facciale, niente AI per manipolare il comportamento umano in modi dannosi.</span><span style=\"font-weight: 400;\"><br><br></span></li>\n</ul>\n<p><span style=\"font-weight: 400;\">Il messaggio è chiaro: più regole, più responsabilità. E, se non si rispettano, si rischiano multe pesanti: fino a 40 milioni di euro o il 7% del fatturato.</span></p>\n<p><span style=\"font-weight: 400;\">Ma attenzione: l’AI Act non sostituisce il GDPR. Piuttosto, ci lavora insieme: il GDPR tutela i dati a valle, l’AI Act agisce a monte. In pratica, il GDPR dice: “Se tratti dati personali, fallo bene”. L’AI Act aggiunge: “E se sviluppi l’IA, progettala in modo sicuro, trasparente e rispettoso dei diritti delle persone”.</span></p>\n<h2>Casi concreti: quando i rischi diventano realtà</h2>\n<p><span style=\"font-weight: 400;\">A questo punto potresti pensare: “Ok, tutto chiaro, ma questi rischi sono solo ipotesi o sono già successe cose serie?”. Spoiler: sono successe. Eccome, e altre ne succederanno in futuro. Ecco alcuni casi che mostrano come le cose possano andare storte – anche quando si tratta di aziende multimiliardarie.</span></p>\n<h5><strong>🚨 </strong>La sanzione italiana a OpenAI: un campanello d’allarme</h5>\n<p><span style=\"font-weight: 400;\">Dicembre 2024, Italia. OpenAI si becca una multa da 15 milioni di euro per violazioni al GDPR legate a ChatGPT: mancanza di trasparenza, nessun filtro per i minori, inesattezze nei dati, e per finire, una notifica incompleta di un data breach. In pratica, OpenAI aveva creato uno strumento potentissimo, ma si era dimenticata (o aveva trascurato) le regole europee sulla privacy. La multa italiana è stata la prima di questo livello in Europa per un sistema di IA generativa. Un segnale fortissimo, quasi un messaggio in codice: “Ehi, Big Tech, svegliatevi. Le regole valgono anche per voi”.</span></p>\n<p><span style=\"font-weight: 400;\">E guarda caso, dopo questo scossone, altre autorità europee hanno iniziato a muoversi, e il Comitato Europeo per la Protezione dei Dati (EDPB) ha creato una task force su ChatGPT. Segno che, ormai, l’attenzione è alta.</span></p>\n<h5>🚨 Il reclamo NOYB in Austria: l’IA non è infallibile</h5>\n<p><span style=\"font-weight: 400;\">Altro caso interessante:</span><a href=\"https://noyb.eu/it/chatgpt-provides-false-information-about-people-and-openai-cant-correct-it\"><span style=\"font-weight: 400;\"> il reclamo presentato da NOYB</span></a><span style=\"font-weight: 400;\"> (l’associazione fondata da Max Schrems, un nome che chi si occupa di privacy conosce bene) contro OpenAI in Austria. Il problema? Un personaggio pubblico ha chiesto a ChatGPT informazioni su di sé e ha ricevuto dati sbagliati. Ha provato a far correggere l’errore, ma niente da fare: OpenAI ha detto che non può né modificare i dati generati né sapere esattamente da dove provengano.</span></p>\n<h5>🚨 Il bug di ChatGPT (2023): quando le chat private diventano pubbliche</h5>\n<p><span style=\"font-weight: 400;\">Marzo 2023. Un bug tecnico su ChatGPT permette ad alcuni utenti di vedere i titoli delle conversazioni di altri e, in certi casi, dettagli di pagamento. Roba che fa venire i brividi, perché ci ricorda che </span><strong>nulla è davvero privato</strong><span style=\"font-weight: 400;\"> su queste piattaforme. OpenAI ha dovuto correre ai ripari, ma ha commesso un errore grave: non ha notificato subito il data breach a tutte le autorità europee, come richiesto dal GDPR. Questo ha pesato nella sanzione italiana del 2024.</span></p>\n<h5>🚨 Samsung e il divieto interno: un caso significativo</h5>\n<p><span style=\"font-weight: 400;\">Ad aprile 2023, alcuni ingegneri di Samsung – probabilmente in buona fede – hanno caricato pezzi di codice sorgente su ChatGPT per farsi aiutare nel debug. Risultato? Quello stesso codice è finito nei log del chatbot e potenzialmente potrebbe essere stato usato per addestrare modelli futuri. Immagina: un segreto industriale che finisce in un sistema terzo fuori dal tuo controllo. La reazione di Samsung? Un divieto netto: niente più chatbot sulle reti aziendali e sui dispositivi interni. E non sono stati i soli: anche banche come JPMorgan e aziende come Apple hanno preso provvedimenti rigorosi simili. Queste casistiche evidenziano un rischio privacy “indiretto”: non tanto la violazione dei dati personali, quanto la perdita di </span><strong>confidenzialità di dati aziendali</strong><span style=\"font-weight: 400;\"> (che spesso includono anche dati personali di clienti) quando si usano LLM senza cautele o pensiero critico.</span></p>\n<h5>🚨 Zoom e l’aggiornamento delle policy: quando “consenso” diventa un concetto elastico</h5>\n<p><span style=\"font-weight: 400;\">Estate 2023: Zoom aggiorna i suoi termini di servizio e sembra voler usare audio, video e chat delle riunioni per addestrare le proprie IA. Scoppia il caso: utenti e media insorgono, e Zoom fa marcia indietro (almeno in parte). Ma la faccenda resta ambigua: perché se tu, come organizzatore della riunione, accetti certe funzionalità AI (come la trascrizione automatica), di fatto stai anche dando il consenso all’uso dei dati per il training. I partecipanti? Se non vogliono che le loro parole vengano usate, devono semplicemente… non partecipare alla riunione. È un po’ come firmare un contratto senza possibilità di negoziare le clausole: o prendi tutto o niente.</span></p>\n<h2>Le strategie delle Big Tech: tra “data grabbing” e correzioni tardive</h2>\n<p><span style=\"font-weight: 400;\">Ora, fermiamoci un attimo. Perché le Big Tech fanno quello che fanno? È semplice: i modelli generativi – ChatGPT, Claude, Gemini, e compagnia – </span><strong>hanno fame di dati</strong><span style=\"font-weight: 400;\">. E non di due spiccioli: servono trilioni di parole, milioni di immagini, video, registrazioni audio. Più dati hai, più il modello è potente.</span></p>\n<p><span style=\"font-weight: 400;\">Il problema è che per un po’ le regole sono state ignorate. OpenAI, Google, Meta – tutti hanno fatto scraping selvaggio del web: post, articoli, commenti, banche dati opache, perfino dati personali come email o numeri di telefono lasciati su forum dimenticati. E hanno usato questi dati senza chiedere nulla a nessuno. Quando le proteste sono iniziate – autori, artisti, giornalisti, cittadini comuni – le aziende hanno cominciato a fare un passo indietro (o quasi).</span></p>\n<p><span style=\"font-weight: 400;\">OpenAI ha smesso di elencare dettagli sui dataset usati per GPT-4, dopo averlo fatto per GPT-3. Perché? Dicono per ragioni di sicurezza e competizione, ma la verità è che meno si dice, meno problemi si rischia.</span></p>\n<p><span style=\"font-weight: 400;\">Google, invece, ha aggiornato la sua privacy policy per dire chiaramente che usa “dati pubblicamente disponibili” per addestrare l’IA. Ma cosa significa “pubblicamente disponibili”? Anche un post su un blog personale è pubblico, ma non vuol dire che chi lo ha scritto voglia vederlo usato per addestrare un chatbot. È un terreno scivoloso, e il rischio di cause legali è concreto: nel 2023, ad esempio, ci sono state class action contro OpenAI e Meta per l’uso di contenuti protetti da copyright nei training set.</span></p>\n<p><span style=\"font-weight: 400;\">Poi ci sono le correzioni di rotta. OpenAI, dopo il caso italiano, ha introdotto un modulo per richiedere la cancellazione dei dati personali dai risultati di ChatGPT. Un passo avanti, certo. Ma resta una domanda: <strong>chi controlla davvero che questi dati vengano rimossi?</strong> E in quanti sanno che possono fare questa richiesta?</span></p>\n<p><span style=\"font-weight: 400;\">Intanto, le aziende stanno anche sperimentando nuove strategie: partnership con editori (ad esempio OpenAI con Associated Press), licenze con piattaforme come Shutterstock, e modelli “business” a pagamento che promettono più privacy. <strong>È come se la privacy stesse diventando un servizio premium</strong>: se paghi, ti proteggiamo i dati; se usi il servizio gratuito, sappi che i tuoi dati potrebbero servire a migliorare il modello, del resto, come ci ricorda Friedman, in economia “<strong>non esistono pasti gratis</strong>” e quando stai utilizzando qualcosa di gratuito probabilmente il prodotto sei tu.</span></p>\n<h2>E noi? Cosa possiamo fare per proteggerci?</h2>\n<p><span style=\"font-weight: 400;\">A questo punto ci si potrebbe sentire un po’ sopraffatti. Ma non è tutto fuori dal nostro controllo. Ci sono cose concrete che possiamo fare per proteggerci, come utenti e come cittadini.</span></p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><strong>Non condividere dati sensibili nelle chat AI</strong><span style=\"font-weight: 400;\">: sembra banale, ma spesso ci dimentichiamo che anche un messaggio apparentemente innocuo (“Mio figlio fa la terza media a Milano e ha problemi con la matematica”) contiene dati personali. Meglio evitare.</span><span style=\"font-weight: 400;\"><br><br></span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><strong>Controllare le impostazioni di privacy</strong><span style=\"font-weight: 400;\">: molti servizi, come ChatGPT, ora offrono opzioni per non salvare la cronologia o non contribuire al training. In alcuni casi sono nascoste. Usale. E, quando i servizi lo consentono, cancellare la cronologia o disattivare la memoria. </span><span style=\"font-weight: 400;\"><br><br></span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><strong>Leggere (almeno una volta) le informative privacy</strong><span style=\"font-weight: 400;\">: lo sappiamo, è noioso. Ma almeno una volta proviamo a darci un’occhiata: ci sono spesso dettagli importanti. Atrettanto spesso però cambiano e quindi vanno rilette ogni tanto.</span><span style=\"font-weight: 400;\"><br><br></span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><strong>Esercitare i tuoi diritti</strong><span style=\"font-weight: 400;\">: puoi chiedere di accedere ai tuoi dati, di cancellarli, o di opporti al trattamento. È un tuo diritto – usalo.</span><span style=\"font-weight: 400;\"><br><br></span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><strong>Se sei un educatore o un genitore, parla di questi temi con i ragazzi</strong><span style=\"font-weight: 400;\">: sono loro i primi a usare queste tecnologie, spesso senza rendersene conto. Un po’ di consapevolezza in più può fare la differenza.</span><span style=\"font-weight: 400;\"><br><br></span></li>\n</ul>\n<h2>In fondo, privacy e IA non sono nemici</h2>\n<p><span style=\"font-weight: 400;\">Lo so, la tentazione è pensare che la privacy e l’IA siano due cose in conflitto: o proteggi i tuoi dati o usi la tecnologia. Ma non deve per forza essere così. Possiamo (e dobbiamo) trovare un equilibrio: costruire IA potenti e utili, ma rispettose della nostra sfera privata, sopratutto etiche e non discriminatorie.</span></p>\n<p><span style=\"font-weight: 400;\">Le leggi ci sono – il GDPR, l’AI Act – ma da sole non bastano. Servono aziende più trasparenti, utenti più consapevoli, e autorità più reattive. <strong>È una sfida collettiva</strong>.</span></p>\n<p><span style=\"font-weight: 400;\">Una cosa è certa: più conosciamo questi strumenti, più possiamo usarli in modo intelligente, senza rinunciare ai nostri diritti. Non dobbiamo smettere di fare domande, di pretendere chiarezza, di chiedere “Scusate, ma i miei dati dove vanno a finire?”. È solo così che l’IA diventerà davvero uno strumento al nostro servizio, e non il contrario.</span></p>\n<h2>Quanti dati sa di te l’AI? Più di quanto immagini (ma meno di quanto pensi)</h2>\n<p>È una domanda che inizia a girare sempre più spesso tra chi usa ChatGPT o altri assistenti intelligenti: <em>“Ma questa AI, quanto sa di me?”</em> Se la usi spesso, potresti avere l’impressione che ti legga nel pensiero. A volte ti anticipa, altre volte ti dà una risposta che suona... troppo su misura. La verità? Un LLM (modello linguistico) non ha una memoria infinita né spia la tua vita – almeno, non nel modo in cui immagini. Ma può <strong>dedurre molte cose da come gli parli</strong>, anche se non gliele hai dette esplicitamente. È un po’ come con un barista che ti vede tutti i giorni: anche se non ti sei mai presentato, sa che prendi il cappuccino con poco zucchero, che arrivi trafelato e che il lunedì sei più silenzioso. Il barista poi ricorda ciò che sente ed è capace di collegarlo ad altre notizie o informazioni. L’AI fa lo stesso, solo che lo fa in silenzio, e in modo statistico.</p>\n<h5>Esperimenti da fare in salotto</h5>\n<p>Vuoi testare quanto un chatbot AI ha imparato su di te? <span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">Prova questi piccoli esperimenti. Niente di tecnico, promesso. Prima cosa: chiedi all’AI direttamente </span><em style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">“Cosa sai di me?”</em><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">. Nella maggior parte dei casi, se stai usando un modello chiuso come ChatGPT o Claude, ti risponderà qualcosa tipo </span><em style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">“Non ho informazioni personali su di te”</em><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">. </span><span style=\"font-weight: 400;\">I modelli chiusi come quelli di OpenAI o Anthropic sono </span><strong style=\"font-family: var(--editor-font-family); font-size: inherit;\">programmati per non fornire dati personali</strong><span style=\"font-weight: 400;\"> di individui privati.</span><span style=\"font-weight: 400;\"> </span><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">Ma se sei nella </span><strong style=\"font-family: var(--editor-font-family); font-size: inherit;\">stessa chat</strong><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\"> in cui hai già detto “Mi chiamo Lucia e faccio l’infermiera”, potresti scoprire che te lo ripete: ha </span><strong style=\"font-family: var(--editor-font-family); font-size: inherit;\">memoria contestuale</strong><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">, cioè ricorda quello che le hai detto poco fa. Vuoi spingerti oltre? Chiedile: </span><em style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">“Che tipo di personalità pensi io abbia?\", \"Puoi fare un profilo della mia personalità?”</em><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\"> oppure </span><em style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">“Quali argomenti tratto più spesso con te?”</em><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">. </span><span style=\"font-weight: 400;\">Questo invoglia l’AI a sintetizzare i </span><strong style=\"font-family: var(--editor-font-family); font-size: inherit;\">tratti ricorrenti</strong><span style=\"font-weight: 400;\"> che hai mostrato. Potrebbe </span><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">stupire con un piccolo ritratto basato su ciò che hai scritto. Non è una scheda FBI, ma una </span><strong style=\"font-family: var(--editor-font-family); font-size: inherit;\">fotografia probabilistica</strong><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">. E se usi un servizio con memoria attiva (come la funzione “istruzioni personalizzate” di OpenAI), puoi anche provare: </span><em style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">“Quali dettagli su di me stai usando?”</em><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\"> – così verifichi cosa si è tenuta in tasca da altre conversazioni. Si potrebbe tentare anche qualche domanda investigativa inversa </span><strong style=\"font-family: var(--editor-font-family); font-size: inherit;\"> <i><span style=\"font-weight: 400;\">“Esaminando come ti ho posto le domande finora, noti qualche errore o abitudine sbagliata che ho quando chiedo qualcosa?”, \"Puoi dirmi quali sono i tipi di aiuto o gli argomenti che ti ho chiesto più spesso finora?”</span></i><span style=\"font-weight: 400;\">. Questo costringe l’AI a ripensare alle tue interazioni e magari citare esempi di domande che hai fatto. </span></strong><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">Potremmo indagare il cosidetto \"blind spot\" </span><strong style=\"font-family: var(--editor-font-family); font-size: inherit;\"><span style=\"font-weight: 400;\">chiedendo <i>“Basandoti sulle nostre conversazioni, c’è qualcosa di significativo che secondo te mi sfugge o tendo a ignorare?”. </i></span><span style=\"font-weight: 400;\">È come chiedere un parere esterno sulle tue abitudini. </span></strong><span style=\"font-weight: 400;\">Questo non è tanto un dato “raccolto”, quanto una </span><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">inferenza</span><strong style=\"font-family: var(--editor-font-family); font-size: inherit;\"><span style=\"font-weight: 400;\">: l’AI rielabora i dati delle tue interazioni per darti un feedback su di te e questo ti fa capire come il modello analizza e profila in qualche modo il tuo comportamento.</span></strong></p>\n<p>Teniamo bene a mente che sono sempre tutte <strong>risposte di tipo probabilistico </strong>(senza intelligenza) e quindi vanno prese con leggerezza e nella consapevolezza che <strong>possono essere errate.</strong></p>\n<h5>Un dossier invisibile? No, ma meglio restare svegli</h5>\n<p>C’è però un’altra faccia della medaglia. Anche se il modello stesso non ti può elencare i dati raccolti (non è progettato per questo), <strong>la piattaforma che lo gestisce sì</strong>. Dietro le quinte, i server registrano la cronologia delle chat, l’orario, il tipo di dispositivo usato, la posizione approssimativa. Principalmente per motivi tecnici e legali. Il problema è che tu, utente comune, <strong>non puoi vedere tutto questo in chiaro</strong>: non c’è un pulsante “<em>Scarica ciò che sai di me</em>” o “<em>Cancella tutto e dimenticati di me</em>” accessibile direttamente dall’AI. Vuoi sapere davvero quali dati hanno memorizzato? Devi fare una richiesta formale al provider – ad esempio tramite i moduli privacy di OpenAI – oppure disattivare le funzioni di cronologia e memoria, e purtroppo una vera cancellazione non sempre è possibile, ancor più oggi e in futuro dove i sistemi sono e stanno diventando sempre più Agenti, inevitabilmente condividono sempre più dati con sistemi terzi (anche a noi ignoti). Insomma, l’<strong>AI non ha una sfera di cristallo</strong>, ma se la alimenti a lungo e le lasci indizi... <strong>impara a riconoscerti</strong>. Con misura e consapevolezza, può essere uno specchio utile e potrebbe diventare anche uno strumento introspettivo interessante. Ma non dimenticare: ogni volta che parli con un sistema AI, <strong>non sei mai del tutto solo</strong>.</p>\n<p>Un consiglio guida potrebbe essere “<strong>mai condividere cose che normalmente non condivideresti in pubblico</strong>”.</p>\n<hr>\n<p class=\"align-center\">Questo post è parte della rubrica <strong><a href=\"https://pianetararo.org/traiettorie/\">TrAIettorie</a></strong> di cui potete trovare l'indice completo <a href=\"https://pianetararo.org/tags/traiettorie/\">qui</a>.</p>",
            "image": "https://pianetararo.org/media/posts/21/g9ddxhg9ddxhg9dd.jfif",
            "author": {
                "name": "Pianetararo Associazione Culturale"
            },
            "tags": [
                   "TRAIETTORIE"
            ],
            "date_published": "2025-05-01T20:49:00+02:00",
            "date_modified": "2025-06-10T17:17:33+02:00"
        },
        {
            "id": "https://pianetararo.org/traiettorie-2/",
            "url": "https://pianetararo.org/traiettorie-2/",
            "title": "TrAIettorie",
            "summary": "📌 È online TRAIETTORIE, la nuova sezione di pianetararo dedicata a esplorare l'educazione critica e consapevole nell'universo digitale. Insegnanti, educatori, famiglie e curiosi del digitale troveranno riflessioni, approfondimenti e strumenti pratici per comprendere come le tecnologie digitali e l'intelligenza artificiale stanno cambiando il nostro modo di&hellip;",
            "content_html": "<p>📌 È online <strong><a href=\"https://pianetararo.org/traiettorie/\">TRAIETTORIE</a></strong>, la nuova sezione di <strong>pianetararo</strong> dedicata a esplorare l'educazione critica e consapevole nell'universo digitale. Insegnanti, educatori, famiglie e curiosi del digitale troveranno <span style=\"text-decoration: underline;\"><span style=\"color: #000000; text-decoration: underline;\">riflessioni</span></span>, approfondimenti e strumenti pratici per comprendere come le tecnologie digitali e l'intelligenza artificiale stanno cambiando il nostro modo di apprendere e comunicare. Non ci limitiamo a raccontare l'innovazione, ma ne analizziamo rischi, opportunità e implicazioni educative ed etiche. Un viaggio aperto e dinamico, fatto di <span style=\"text-decoration: underline;\">domande</span>, confronti e <span style=\"text-decoration: underline;\">laboratori </span>per costruire insieme una <strong>cultura digitale consapevole e responsabile</strong>. Seguici, iscriviti alla nostra <strong>newsletter </strong>e contattaci per proposte educative personalizzate!</p>",
            "image": "https://pianetararo.org/media/posts/20/aditya-vyas-jey6eFHP4kA-unsplash.jpg",
            "author": {
                "name": "Pianetararo Associazione Culturale"
            },
            "tags": [
            ],
            "date_published": "2025-05-01T16:39:00+02:00",
            "date_modified": "2025-06-10T14:46:02+02:00"
        },
        {
            "id": "https://pianetararo.org/frammenti-25-ora-disponibile-su-lulu-2/",
            "url": "https://pianetararo.org/frammenti-25-ora-disponibile-su-lulu-2/",
            "title": "FRAMMENTI #25 disponibile anche su Amazon",
            "summary": "<p>Da poco disponibile <strong>FRAMMENTI #25</strong> anche su Amazon.it in versione più compatta.</p>\n",
            "content_html": "<p>Da poco disponibile <strong>FRAMMENTI #25</strong> anche su Amazon.it in versione più compatta.</p>\n\n<h2><strong>📓 Disponibile l'edizione in formato brossura </strong></h2>\n<p> </p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://pianetararo.org/media/posts/14/frammenti.brosssura.PNG\" alt=\"\" width=\"363\" height=\"416\" sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://pianetararo.org/media/posts/14/responsive/frammenti.brosssura-xs.PNG 640w ,https://pianetararo.org/media/posts/14/responsive/frammenti.brosssura-sm.PNG 768w ,https://pianetararo.org/media/posts/14/responsive/frammenti.brosssura-md.PNG 1024w ,https://pianetararo.org/media/posts/14/responsive/frammenti.brosssura-lg.PNG 1366w ,https://pianetararo.org/media/posts/14/responsive/frammenti.brosssura-xl.PNG 1600w ,https://pianetararo.org/media/posts/14/responsive/frammenti.brosssura-2xl.PNG 1920w\"></figure>\n<p>Se preferite la <strong>versione rilegata in brossura, </strong>ora potete acquistarla! Questa edizione, manterrà tutta la qualità dei contenuti di <strong>FRAMMENTI #25</strong>, con una rilegatura più tradizionale.</p>\n<p><a href=\"https://www.amazon.it/FRAMMENTI-25-Pamela-Benedetti/dp/B0DPG4L2NN/ref=sr_1_2?__mk_it_IT=%C3%85M%C3%85%C5%BD%C3%95%C3%91&amp;crid=KYMAD9XVXXIA&amp;dib=eyJ2IjoiMSJ9.t9wRYiv452AhlPvrqf6An_6nPKQggLbmWWjrdjbe6CfWp9YvubMoS0URzm26falnV-JsGPST5KLvCz_BZ-zZHBOhoBINrpbfs2ZEC0LuGDQ3hCLoe0i6ATIGY1esXskQ1h5U3_FN0-BB1AWPlX8QHlCVDOQTSKd4FxIzwcoyx0e5kcNp7nHjoiXTBQwxub5p_Jt-xavqFdks07LV9BC9c_yePzrzo_hOQILXWWVKJ7Y.rdi9V1NTcjffx1NUoG5YhXEB6RO2verJeQ1GV1yQJl8&amp;dib_tag=se&amp;keywords=frammenti+25&amp;nsdOptOutParam=true&amp;qid=1734382345&amp;sprefix=frammenti25%2Caps%2C107&amp;sr=8-2\" target=\"_blank\" rel=\"noopener noreferrer\">Acquista su Amazon</a></p>\n<p> </p>\n<p><a href=\"https://www.lulu.com/it/shop/erica-menozzi-and-fabrizio-lugli-and-pamela-benedetti/frammenti-25/paperback/product-rm8ppj5.html?q=frammenti%2325&amp;page=1&amp;pageSize=4\"></a><strong><a href=\"https://pianetararo.org/frammenti25intro/\">Qui troverai maggiori informazioni su FRAMMENTI #25</a></strong></p>",
            "image": "https://pianetararo.org/media/posts/14/frammenti.brosssura-2.PNG",
            "author": {
                "name": "Pianetararo Associazione Culturale"
            },
            "tags": [
                   "FRAMMENTI"
            ],
            "date_published": "2025-01-01T13:14:24+01:00",
            "date_modified": "2025-06-10T08:56:36+02:00"
        },
        {
            "id": "https://pianetararo.org/frammenti-25-ora-disponibile-su-lulu/",
            "url": "https://pianetararo.org/frammenti-25-ora-disponibile-su-lulu/",
            "title": "FRAMMENTI #25 Ora Disponibile su Lulu",
            "summary": "<p>Siamo entusiasti di annunciarvi che <strong>FRAMMENTI #25</strong> è finalmente disponibile per l'acquisto online su <strong>Lulu</strong>! La prima edizione è arrivata in una versione <strong>rilegata a spirale</strong>, perfetta per chi ama combinare funzionalità ed estetica.</p>\n",
            "content_html": "<p>Siamo entusiasti di annunciarvi che <strong>FRAMMENTI #25</strong> è finalmente disponibile per l'acquisto online su <strong>Lulu</strong>! La prima edizione è arrivata in una versione <strong>rilegata a spirale</strong>, perfetta per chi ama combinare funzionalità ed estetica.</p>\n\n<h3><strong>Perché scegliere la versione a spirale?</strong></h3>\n<p>La rilegatura a spirale offre vantaggi, soprattutto per chi desidera un'esperienza di scrittura pratica e piacevole. La versione a spirale permette infatti di aprire completamente il taccuino a 360°, lasciando le pagine perfettamente piatte e rendendo più facile annotare, disegnare e prendere appunti senza il fastidio di dover tenere le pagine ferme. Inoltre vi da l'opportunità di estrarre o strappare le pagine :-) e avere pieno controllo dello spazio su ogni angolo delle pagine. Insomma, è la scelta perfetta per chi ama la creatività senza limiti.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://pianetararo.org/media/posts/11/PXL_20241130_062812942.jpg\" alt=\"\" width=\"498\" height=\"280\" sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://pianetararo.org/media/posts/11/responsive/PXL_20241130_062812942-xs.jpg 640w ,https://pianetararo.org/media/posts/11/responsive/PXL_20241130_062812942-sm.jpg 768w ,https://pianetararo.org/media/posts/11/responsive/PXL_20241130_062812942-md.jpg 1024w ,https://pianetararo.org/media/posts/11/responsive/PXL_20241130_062812942-lg.jpg 1366w ,https://pianetararo.org/media/posts/11/responsive/PXL_20241130_062812942-xl.jpg 1600w ,https://pianetararo.org/media/posts/11/responsive/PXL_20241130_062812942-2xl.jpg 1920w\"></figure>\n<h3><strong>Spedizione e tempistiche...</strong></h3>\n<p>I tempi di spedizione che Lulu stimerà in fase di ordine potrebbero risultare piuttosto lunghi, forse perchè si tratta di una previsione con partenza dagli USA. <span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">Abbiamo sperimentato noi stessi un paio di ordini di prova e, nella realtà, i tempi sono risultati molto diversi e decisamente più rapidi rispetto alle stime (in genere meno della metà della previsione) perchè ci è sempre stato assegnato uno stabilimento situato in Francia. Confidiamo che anche voi possiate sperimentare un esperienza di consegna facile e veloce.  </span></p>\n<p><a href=\"https://www.lulu.com/it/shop/erica-menozzi-and-fabrizio-lugli-and-pamela-benedetti/frammenti-25/paperback/product-rm8ppj5.html?q=frammenti%2325&amp;page=1&amp;pageSize=4\"><strong>Acquista ora la tua copia su Lulu</strong></a></p>\n<p>Grazie a tutti voi che avete atteso con pazienza. Siamo certi che <strong>FRAMMENTI #25</strong> diventerà un compagno piacevole per il vostro anno di scoperte e ispirazioni!</p>\n<p><a href=\"https://www.lulu.com/it/shop/erica-menozzi-and-fabrizio-lugli-and-pamela-benedetti/frammenti-25/paperback/product-rm8ppj5.html?q=frammenti%2325&amp;page=1&amp;pageSize=4\"></a><strong><a href=\"https://pianetararo.org/frammenti25intro/\">Qui troverai maggiori informazioni su FRAMMENTI #25</a></strong></p>",
            "image": "https://pianetararo.org/media/posts/11/PXL_20241130_063133590.jpg",
            "author": {
                "name": "Pianetararo Associazione Culturale"
            },
            "tags": [
                   "FRAMMENTI"
            ],
            "date_published": "2024-11-30T07:32:52+01:00",
            "date_modified": "2025-06-10T08:56:44+02:00"
        }
    ]
}
